'''Два узла, находящиеся в одной сети, имеют IP-адреса 112.117.107.70 и 112.117.121.80. 
Укажите наименьшее возможное количество адресов в этой сети.'''
from ipaddress import*
for mask in range(33):
    net1 = ip_network(f'112.117.107.70/{mask}',0)
    net2 = ip_network(f'112.117.121.80/{mask}',0)
    if net1 == net2:
        print(net1,2**(32-mask))
#8192