'''Для узла c IP-адресом 115.53.128.88 адрес подсети равен 115.53.128.0. Сколько
существует различных возможных значений третьего слева байта маски, если
известно, что в этой сети не менее 1000 узлов? Ответ запишите в виде
десятичного числа.
'''
from ipaddress import*
ip = ip_address('115.53.128.88')
for mask in range(33):
    net = ip_network(f'115.53.128.88/{mask}',0)
    if str(net)==f'115.53.128.0/{mask}' and net[0]<ip<net[-1]:
        if 2**(32-mask) >=1000:
            print(net,net.netmask)
#6
'''
115.53.128.0/17 255.255.128.0
115.53.128.0/18 255.255.192.0
115.53.128.0/19 255.255.224.0
115.53.128.0/20 255.255.240.0
115.53.128.0/21 255.255.248.0
115.53.128.0/22 255.255.252.0'''