'''Два узла, находящиеся в разных подсетях, имеют IP-адреса 157.127.182.76 и
157.127.190.80. В масках обеих подсетей одинаковое количество единиц.
Укажите наименьшее возможное количество единиц в масках этих подсетей.
'''
from ipaddress import*
ip1 = ip_address('157.127.182.76')
ip2 = ip_address('157.127.190.80')
for mask in range(33):
    net1 = ip_network(f'157.127.182.76/{mask}',0)
    net2 = ip_network(f'157.127.190.80/{mask}',0)
    if net1!=net2 and net1[0]<ip1<net1[-1] and net2[0]<ip2<net2[-1]:
        print(net1,net1.netmask)
#21