'''Определите число N, для которого выполняется равенство .
103_N = 97_N+2
'''
for n in range(10,33):
    if  int('103',n) == int('97',n+2):
        print(n)
#Otvet 11